OF_Sim_Marcos/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "0.02/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7231;
        startFace       854892;
    }
    inlet
    {
        type            patch;
        nFaces          1250;
        startFace       862123;
    }
    outlet
    {
        type            patch;
        nFaces          1250;
        startFace       863373;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       864623;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80388;
        startFace       867123;
    }
)

// ************************************************************************* //
